{
  "backend/main.mo": "Empty Motoko actor file serving as the backend entry point for the Internet Computer canister.",
  "feature_evidence.json": "Feature evidence report documenting implemented features with file mappings, component dependencies, test IDs, and confidence levels for the portfolio website.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files describing their purpose and functionality, including components, hooks, utilities, and configuration files.",
  "frontend/index.css": "Global Tailwind CSS configuration with OKLCH color system variables for light and dark themes, including custom CSS properties for UI components.",
  "frontend/index.html": "HTML entry point that loads the React application via main.tsx module script with viewport and charset configuration.",
  "frontend/src/App.tsx": "Root React component that wraps the application with ThemeProvider, renders all page sections, and includes global animation components (FloatingBlobs, CursorFollower, PageLoadAnimation).",
  "frontend/src/components/About.tsx": "About section component featuring glassmorphism card with bio text, animated stat counters (projects, clients, satisfaction), and tech stack badges with staggered hover effects.",
  "frontend/src/components/Contact.tsx": "Contact section with form inputs (name, email, message), social media links with pulse effects, confetti animation on submission, and footer attribution to caffeine.ai.",
  "frontend/src/components/CursorFollower.tsx": "Custom cursor component with trailing circle effect that tracks mouse movement using native JavaScript, automatically disabled on touch devices.",
  "frontend/src/components/Experience.tsx": "Displays a timeline of work experience with animated cards showing job titles, companies, periods, descriptions, and achievements. Uses scroll animation hook and renders a vertical timeline with gradient styling.",
  "frontend/src/components/FloatingBlobs.tsx": "Renders animated floating gradient blobs in the background with randomized durations and delays. Creates four fixed-position blurred circles with neon colors for visual ambiance.",
  "frontend/src/components/Hero.tsx": "Main hero section with exploding letter animation for the name, floating avatar, typing effect tagline, and CTA buttons. Includes parallax effects and particle background integration.",
  "frontend/src/components/Navbar.tsx": "Fixed navigation bar with scroll-based backdrop blur, smooth scrolling to sections, theme toggle, and responsive mobile menu. Includes staggered animation on mount and gradient underline hover effects.",
  "frontend/src/components/PageLoadAnimation.tsx": "Utility component that applies staggered fade-in and slide-up animations to all page sections on initial load. Returns null as it only manipulates DOM styles via useEffect.",
  "frontend/src/components/ParticleBackground.tsx": "Canvas-based particle system with moving dots connected by lines when within proximity. Renders animated particles with gradient background and handles window resize events.",
  "frontend/src/components/ProjectCard.tsx": "Individual project card component with 3D hover effects, confetti trigger on click, and animated entrance. Displays project image placeholder, tech badges, and links to live demo and GitHub.",
  "frontend/src/components/Projects.tsx": "Projects section displaying a grid of six featured projects using ProjectCard components. Includes scroll animation hook and renders project data with titles, descriptions, tech stacks, and links.",
  "frontend/src/components/Skills.tsx": "React component that displays a skills section with three categories (Frontend, Backend, Tools) using animated progress bars and glassmorphic cards. Uses scroll animation hook to trigger progress bar animations when the section becomes visible.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages ICP backend actor creation with Internet Identity authentication. Automatically recreates the actor when identity changes and invalidates dependent queries.",
  "frontend/src/hooks/useCountUp.ts": "Custom React hook that animates a number counting up from 0 to a target value over 2 seconds when triggered. Uses setInterval to increment the count in 60 steps.",
  "frontend/src/hooks/useInternetIdentity.ts": "Comprehensive React context and hooks for Internet Identity authentication on ICP, providing login/logout functionality, identity management, and authentication status tracking. Includes provider component and helper functions for creating auth clients with configurable options.",
  "frontend/src/hooks/useParallax.ts": "Custom React hook that tracks mouse position relative to the window center, returning normalized x/y coordinates for parallax effects. Adds and cleans up mousemove event listener.",
  "frontend/src/hooks/useScrollAnimation.ts": "Custom React hook using IntersectionObserver to detect when an element becomes visible in the viewport. Returns a boolean that becomes true when the element intersects with a 10% threshold.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom design tokens for light/dark themes, including neon color variables (cyan, magenta, electric-blue), glassmorphism effects, and animation keyframes for typing and glitch effects. Uses OKLCH color space for better color consistency.",
  "frontend/src/lib/anime.ts": "Lightweight animation library implementation using native Web Animations API as an alternative to anime.js. Supports element animations with duration, delay, easing, looping, and includes stagger and random utility functions.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for ICP authentication. Renders the main App component.",
  "frontend/src/types/animejs.d.ts": "Empty TypeScript declaration file for anime.js types (placeholder file with no content).",
  "frontend/src/utils/confetti.ts": "Utility function that creates a canvas-based confetti animation at specified coordinates, generating 100 colored particles with physics (velocity, gravity) that fade out over time. Automatically cleans up when animation completes.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including OKLCH color system, neon/glassmorphism colors, custom animations (accordion, float, glow, gradient-shift), and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state document defining an ultra-modern animated portfolio landing page for Vijayaraghavan built with React, Tailwind, shadcn/ui, and Anime.js, featuring glassmorphism design, particle systems, parallax effects, and comprehensive feature tracking with 16 implemented features across hero, navigation, about, skills, projects, experience, and contact sections."
}